{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Дана переменная, в которой хранится словарь, содержащий гео-метки для каждого пользователя (пример структуры данных приведен ниже). Вам необходимо написать программу, которая выведет на экран множество уникальных гео-меток всех пользователей.\n",
    "ids = {'user1': [213, 213, 213, 15, 213], \n",
    "       'user2': [54, 54, 119, 119, 119], \n",
    "       'user3': [213, 98, 98, 35]}\n",
    "ids_new = [] # создаем список в который запишем все значения геометок из словаря\n",
    "for x in ids:\n",
    "    ids_new += ids[x]\n",
    "print(set(ids_new)) # переведем список в сет чтобы исключить дубли"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Дана переменная, в которой хранится список поисковых запросов пользователя (пример структуры данных приведен ниже). Вам необходимо написать программу, которая выведет на экран распределение количества слов в запросах в требуемом виде.\n",
    "queries = [\n",
    "    'смотреть сериалы онлайн',\n",
    "    'новости спорта',\n",
    "    'афиша кино',\n",
    "    'курс доллара',\n",
    "    'сериалы этим летом',\n",
    "    'курс по питону',\n",
    "    'сериалы про спорт',\n",
    "]\n",
    "space_numbers = [] # обьявляем список куда будем вносить разбитые на слова элементы начального списка \n",
    "word_count_list = {} # обьявляем пустой словарь куда будет вноситься парно количество слов в элементе списка и сколько раз встречается такое количество слов\n",
    "elem2 = 0 # переменная для обозначения первого элемента первоначального списка для использования в цикле\n",
    "dict1 = 0 # переменная для подсчета сколько раз встречается такое количество слов \n",
    "for elem1 in queries:\n",
    "    space_numbers = queries[elem2].split(' ') # разделяем элемент первоначального списка на слова и записываем в отдельный список чтобы посчитать количество слов\n",
    "    dict1 = len(space_numbers) # считаем количество слов \n",
    "    if dict1 in word_count_list: # проверяем если такое количество слов уже есть в словаре то добавляем в значение\n",
    "        word_count_list[dict1] += 1\n",
    "    else: # если такого количества слов еще нет в коллекции то добавляем ключ и значение равное 1\n",
    "        word_count_list[dict1] = 1\n",
    "    elem2 += 1\n",
    "for key1, value1 in sorted(word_count_list.items()): # сортируем коллекцию чтобы было как в примере\n",
    "    print(f\"Поисковых запросов, содержащих {key1} слов(а): {round(((value1 / elem2) * 100), 2)}%\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
